the
of
given
return
a
is
and
in
an
that
to
are
you
if
integer
array
number
where
be
it
each
can
for
all
n
with
1
two
from
or
there
any
0
one
at
not
by
string
such
as
integers
order
have
on
example
length
following
-
same
nums
x
i
no
has
this
will
only
may
note
0-indexed
2
answer
minimum
value
k
maximum
ith
after
than
sum
some
equal
which
s
possible
its
must
elements
between
should
true
then
binary
first
also
every
otherwise
we
positive
more
find
characters
-1
so
left
right
false
into
represents
list
strings
3
exactly
values
m
other
tree
element
both
ie
2d
nodes
times
empty
size
row
different
time
index
them
contains
least
they
your
int
most
representing
j
node
numbers
sequence
their
make
valid
choose
when
exists
multiple
letters
root
character
write
words
7
b
does
column
either
operation
matrix
result
arrays
distinct
represented
unique
once
query
smallest
do
another
sorted
move
indices
type
adjacent
cannot
consisting
total
non-empty
grid
three
consists
want
digits
format
key
since
operations
within
returns
initially
without
large
class
implement
using
indicates
109
contiguous
starting
position
these
name
modulo
defined
considered
arr
but
less
path
numsi
new
last
largest
range
need
contain
table
greater
set
5
4
containing
before
c
object
lowercase
next
target
start
pair
cell
second
denotes
form
end
guaranteed
function
substring
original
single
initializes
inclusive
word
remaining
even
generated
above
up
primary
subarray
sql
schema
numbered
letter
y
take
consecutive
longest
called
english
means
edges
difference
until
get
respectively
use
remove
edge
input
conditions
test
strictly
allowed
cells
non-negative
rules
labeled
add
connected
pairs
assume
moves
product
digit
id
point
reach
cases
four
however
exist
answers
starts
distance
current
space
design
subsequence
needed
change
always
points
while
leading
deleting
step
follows
ai
day
case
perform
down
positions
score
way
because
group
was
rows
could
top
steps
amount
very
answeri
formed
bi
void
used
nums1
game
data
t
whose
1s
6
returned
9
replace
queries
zero
formally
appear
who
square
num
numsj
represent
many
10
becomes
notice
would
possibly
changing
ascending
graph
present
algorithm
edgesi
linked
varchar
structure
xi
output
smaller
absolute
person
ends
d
ways
head
resulting
takes
line
substrings
pick
nums2
r
impossible
zeros
part
0s
through
appears
itself
solution
below
increasing
jth
about
null
task
count
undirected
children
delete
like
direction
how
performing
let
lexicographically
required
previous
common
turn
numslength
split
cost
yi
swap
good
moving
still
information
removing
subarrays
price
height
determine
consider
representation
odd
separated
corresponding
val
non-decreasing
32-bit
shortest
been
too
search
among
chosen
accepted
complete
8
including
final
report
alice
along
process
become
spaces
arri
place
directly
z
call
types
whether
made
people
average
----------------------
go
except
bottom
equals
out
divisible
coordinates
city
problem
initial
palindrome
p
none
color
reverse
kth
already
infinite
groups
placed
boolean
leaf
level
according
keys
satisfies
actual
child
highest
apply
define
optimally
convert
divide
1-indexed
removed
wants
decimal
pass
ordered
traversal
lower
applying
alphabet
area
prefix
were
code
queriesi
lengths
permutation
shown
occurs
over
uppercase
being
date
solve
added
occurrences
bob
board
trees
days
paths
negative
during
never
check
written
water
abc
plane
player
ab
occurrence
subsequences
derived
l
bitwise
minutes
long
repeat
extra
those
complexity
travel
obtain
outside
playing
u
ones
together
corner
simultaneously
goal
special
subtree
entire
fit
lowest
connecting
necessarily
visit
o
unit
employee
insert
back
turns
parent
duplicates
know
e
obtained
10-5
instead
100
parentheses
frequency
select
money
ans
play
xor
beginning
side
players
system
currently
sort
duplicate
directions
interval
construct
subset
correct
bottom-right
just
concatenation
calls
visited
lists
mat
twice
width
bits
tie
built-in
third
columns
functions
see
top-left
assigned
squares
described
create
seconds
forward
passed
please
build
changed
vertical
flip
stones
text
consist
needs
s1
s2
rectangle
under
greatest
calculate
satisfy
denoting
user
choosing
he
suppose
inside
said
customer
map
prices
east
road
taken
buy
arranged
addition
random
constraints
invalid
located
denote
adding
again
signed
relative
maximize
n-1
upper
starti
endi
full
nth
expression
ansi
exceed
larger
item
maximized
describes
front
------------------------
employees
names
bst
si
rearrange
per
trailing
receive
standing
prime
based
partition
achieve
meaning
done
leftmost
method
repeated
nums1i
rounded
closest
nums0
assign
several
wordsi
replacing
colors
longer
horizontal
divisor
results
coordinate
divided
filled
sentence
occur
location
students
clockwise
available
put
store
ui
vi
rotate
11
fn
places
deleted
arrlength
fewer
wall
land
floor
units
continue
pointsi
division
mentioned
include
run
power
modify
1st
4-directionally
student
adds
followed
123
removes
reads
bit
ending
non-overlapping
numsk
increase
diagonal
round
increment
similarly
arr1
properties
items
col
vertically
west
runs
box
ids
foreign
stone
concatenated
counted
sequences
walk
x-axis
moment
minute
costs
depth
match
calculated
minimized
destination
weight
follow
gets
pattern
backward
vertices
append
stop
state
found
his
encoded
o1
scores
north
south
cities
room
-----------------------
nearest
finish
file
win
inputs
f
palindromic
salary
reaches
robot
events
building
additional
specific
circle
belongs
x1
share
middle
examples
sell
arrj
fits
friends
intervals
merge
immediately
around
rest
constructed
dictionary
assuming
version
rotation
well
h
directed
customers
higher
horizontally
solutions
constant
replaced
event
network
asked
concatenating
-------------------
25
ri
v
onto
begin
continuous
probability
might
red
speed
accepts
program
stops
instance
subtract
subtrees
singly
repeating
pay
seats
w
rectangular
keep
sums
having
cover
friend
going
certain
circular
minimize
belong
rooted
differ
users
now
rule
etc
white
holds
orders
condition
pointer
inserted
modified
products
applied
jump
leave
our
work
piles
randomly
12
company
base
off
due
making
center
x2
matches
2nd
wait
performed
bidirectional
transactions
profit
seat
similar
2n
shows
rightmost
rearranging
identical
leaves
wins
sign
inserts
non-zero
rotated
included
3rd
dollars
meets
created
-x
leetcode
transform
pile
remains
rounds
decide
nums2i
earliest
associated
had
arr0
hold
high
heights
uses
year
boxes
0th
gridij
stored
serialization
coins
lefti
colored
blue
covered
traveling
limit
five
intersection
numsi1
language
subsets
denoted
degrees
1000
implementation
top-right
swapping
mark
stock
pricesi
zeroes
stack
she
nothing
arithmetic
candies
much
suffix
operator
plus
house
26
free
latest
cycles
segment
bool
permutations
indicating
meet
pricei
car
open
stream
additionally
read
image
alternating
period
finally
brackets
neighbors
decrease
memory
low
rank
double
queue
reorder
roads
stay
placing
axis-aligned
later
across
num1
num2
slength
righti
concatenate
a2
chessboard
hour
ordering
message
received
radius
y1
bottom-left
hours
15
divides
requirements
supports
tasked
arrive
231
piece
arr2
capacity
triplets
what
break
lexicographical
series
x-y
overlapping
started
say
houses
update
tasks
word2
word1
timei
flips
support
rectangles
obstacle
lets
cycle
changes
remain
specifically
13
combination
evaluate
userid
vertex
request
combinations
course
swaps
taking
expressions
c1
mean
significant
surrounded
island
record
sides
decided
productid
anywhere
manager
happens
ensure
amongst
winner
in-place
subsequent
cardinal
vowel
a1
provided
hand
mapping
boundary
factors
90
judge
factor
indexed
labels
answerlength
preorder
missing
sorting
nums2j
us
pieces
played
pushes
overlap
olog
triangle
satisfied
source
weights
come
equivalent
doing
intervalsi
maximal
garden
descendant
street
broken
inserting
help
excluding
insertion
makes
costi
collect
321
rearranged
vice
versa
enum
earlier
modifying
deletion
reversed
absx
cut
4th
balls
block
sets
give
bank
segments
descending
country
enter
frequent
fromi
toi
comes
01
queriesj
black
evaluates
balanced
21
courses
answer1
answer0
world
own
best
encoding
unless
food
objects
cols
calling
reachable
formatted
hi
converted
reports
1th
figure
andor
here
testcases
whole
runtime
querieslength
individually
explanation
abcd
ci
exact
did
toward
fully
vowels
running
real
indicate
q
met
executed
alices
team
rating
symbol
generate
y2
flipping
evenly
nested
transaction
affect
sit
label
exam
job
small
parents
addint
checks
card
methods
abcde
pop
obstacles
chooses
parallel
arbitrary
anagram
shape
weighted
future
parts
multiplication
composed
g
strs
candy
kind
doesnt
regardless
contained
completely
intersect
descendants
ancestor
logs
themselves
notes
nor
passes
able
push
increases
selected
satisfying
happy
absi
earn
rotating
decreasing
operators
visits
closed
centered
half
completed
opposite
finished
print
ball
perfect
ignored
reached
divisors
sold
generates
independent
waiting
workers
worker
picked
beautiful
lines
endpoints
recall
roots
trying
distribute
previously
equally
20
separate
underlined
pairsi
procedure
milliseconds
arguments
threshold
r1
access
custom
shorter
thus
reconstruct
converting
employeeid
age
positioned
101
computer
stores
coin
corresponds
towards
linear
replacement
video
counts
walls
puzzle
built
fixed
station
public
threads
error
her
limited
subtraction
lie
indirectly
104
sitting
forms
partitioned
16
sentences
non-increasing
movement
facing
answerj
pushint
uj
vj
allocate
border
multiply
ranges
wi
others
drop
plant
painted
copy
eat
away
straight
else
loses
fill
particular
definition
wikipedia
allow
constructor
automatically
various
timestamp
server
marked
neither
treat
perimeter
li
neighboring
goes
counterclockwise
works
aa
unknown
property
132
buildings
valuesi
secret
stonesi
collection
field
department
palindromes
reset
arrives
disjoint
compute
shift
falls
fall
cards
printed
nice
content
wrong
simple
necessary
multiplied
hhmm
increments
reference
positioni
arrival
writing
draw
-3
rooms
pilesi
moved
idi
chose
fourth
outgoing
leaving
tasksi
grouped
sequentially
partitions
alternate
requests
huge
evaluation
forming
variable
locations
successful
strength
lost
enough
lose
coming
decoded
customerid
percentage
c2
arrarrlength
shop
further
freely
criteria
determined
intermediate
includes
capital
010
complement
maps
environment
serialized
connection
continues
games
nodeval
library
solutionint
preceding
arrange
rowi
robots
cause
calendar
attack
instructions
thread
tests
messages
teams
diagonally
symbols
applies
instances
50
formula
anagrams
office
05
handle
parenthesis
arrk
splitting
nums1length
computed
happen
traverse
ace
guess
allows
phrase
paint
green
log
partial
apple
i1th
counting
mod
endpoint
security
calculation
recursively
logsi
60
duration
--
transformation
blocked
servers
regular
matching
differs
merged
far
differences
pivot
overall
specified
container
jumps
tokens
repeats
forever
competition
appended
restaurant
parameter
19
components
quality
meeting
attend
shares
manner
shapes
decode
root-to-leaf
website
blocks
kinds
hello
minimal
quantity
23
roadsi
bi-directional
outer
planted
existing
yellow
causes
unfortunately
30
diagonals
connects
beauty
alphanumeric
y-axis
yj
gain
languages
internal
api
named
question
downward
cars
passengers
00
unlock
window
optimal
-231
dot
repeatedly
collected
median
direct
month
gives
flowers
expected
cant
matter
inclusively
conversion
topmost
0000
alphabetically
sale
social
frog
address
frequencies
consecutively
14
chunk
idle
disconnected
describe
choice
varying
prerequisites
tile
likely
spell
delay
parameters
decrement
immediate
orderdate
lodashs
jsonparse
json
neighbor
provide
islands
keeping
ki
attributes
anything
buying
instantaneously
acb
look
xth
returning
picks
bc
beyond
shifting
encode
numeric
walking
stick
infinitely
balloon
xy-plane
arrows
keeps
--------------------------
rate
dist
speedi
kilometers
f1
coli
unoccupied
separating
non-space
causing
triple
appending
configuration
queens
numsl
stations
execute
startpos
begins
phone
sent
ugly
27
seven
40
500
nine
hidden
compare
interface
desired
component
numsnumslength
train
nums3
n-ary
nary-tree
fraction
dice
rolls
dates
engage
relationship
roll
die
better
jumping
inorder
proven
bitwise-xor
nums2length
track
planning
finishes
origin
activity
login
ignoring
0100
eats
indicesi
indexing
productname
wordslength
lead
triplet
diff
allocated
matrixs
x-coordinate
assigning
dropped
floors
section
send
star
compressed
pi
eating
grow
recursive
generator
yields
vice-versa
degree
bar
supply
reduce
gridrc
rob
night
constraint
getint
deletes
resolve
sk
project
working
ended
interpreted
mapped
standard
accounts
emails
email
account
seq
root1
root2
sub-arrays
xs
undefined
bus
distancei
numsn
continuously
token
route
travels
clear
rearrangement
decreases
s3
occurring
removals
picking
paper
integral
euclidean
disturbing
sizes
endtimei
starttimei
numerical
calculates
sj
legal
a0
i0
numi
bag
hamming
aj
ranks
ranking
hasnext
appeared
iterator
script
records
updates
-2
i-th
title
slots
treated
xj
arr2j
arr1i
simplified
i1
appends
knows
unable
skip
questions
denominations
24-hour
collide
passenger
spend
distances
nesting
reaching
jobs
starttime
endtime
rectanglesi
filling
001
key-value
occupied
opening
status
deletions
selling
discount
aforementioned
simplicity
ties
passing
journey
0-9
teacher
receives
1234
wordsj
entries
permi
perm
22
heighti
b2
alphabetical
domino
diagram
possibilities
online
equation
folder
pathsi
compared
recover
wrapping
shifts
ratio
zigzag
searchword
try
typed
candidates
banned
repetition
colorsi
distribution
turned
chunks
flower
participating
media
ten
cuts
234
cross
river
weighti
processed
labelled
refer
signifies
two-dimensional
display
mathematical
therefore
2s
terms
him
trip
details
ability
initialized
produce
balance
trivially
tiles
periods
net
main
actions
session
postorder
usual
105
well-formed
24
furthermore
nums1j
delivery
scheduled
preferred
deeply
r2
remember
forgot
commas
singly-linked
testing
left-to-right
flatten
mountain
interested
lands
strange
calculations
touching
assignment
peoplei
connectionsi
connections
big
selecting
75
managers
tickets
cj
tower
2-dimensional
view
xy
buffer
deserialized
link
deserialize
restriction
serialize
objective
directory
files
cd
aaa
1-9
1-based
sticks
balloons
paid
hire
disti
loss
fx
composition
guards
half-open
implementing
successfully
booking
bookint
ranging
an-1
a3
shuffling
queen
numsr
max
startrow
instruction
executing
though
press
designed
arrleftright
finds
local
six
simply
principle
numerals
flipped
uniquely
effect
ride
numsleft
numsright
denominator
fractional
face
matrices
yyyy-mm-dd
maximizes
enters
mini
splits
pointers
traveled
happened
checked
t2
t1
gcd
uncommon
costsi
someday
device
logged
stacks
bobs
eaten
2020
---------------------------
member
members
summation
y-coordinate
whereas
reuse
plants
entirely
matij
everyone
nobody
identify
submatrices
run-length
p1
p2
apples
iterates
upper-case
bad
averages
buckets
liters
show
non-leaf
comprise
contact
alerting
police
robber
stashed
putint
frequently
normal
ring
wish
callback
reject
throws
years
experience
cpu
execution
cab
dashes
dots
merging
structurally
bsts
wordlist
imagine
xi1
grid00
gridm
1n
worked
volume
existed
libraries
invert
asks
unchanged
numsk-1
gridrowcol
depending
simulate
implemented
deque
double-ended
marks
routes
312
arrangement
entering
sn
5th
011
lucky
driving
restrictions
signal
keyboard
meetings
shared
eventsi
departmentid
departments
painting
xn
valued
cutting
getrandom
candiesi
resulti
giving
targetsum
bags
formats
domain
leetcodecom
pyramid
guarantee
paired
typically
0-based
alength
aba
behind
resultant
aligned
requires
plot
notation
filetxt
removal
market
valuei
obstaclesi
command
via
rangesi
assumed
float
backwards
inputoutput
reminder
importance
pos
expansion
distributed
knight
eight
eventually
corners
evaluated
fnarri
manhattan
arr1length
comprises
ik
conflict
customersi
minus
action
solving
solved
counter-clockwise
held
context
correspond
managerid
magical
catch
drive
clock
destroyed
quantities
elevation
acyclic
flattened
sub-array
few
chain
profiti
force
drawing
unlocks
locked
lock
parenti
determines
converts
whitespace
32
-9
upcoming
staircase
climb
coefficient
updated
dollar
dont
forest
tallest
in-order
heightsi
truncate
12345
2-d
reading
school
booleans
income
salaries
rotations
reformat
info
chars
ingredients
close
preparing
swapped
touches
afterward
positionsi
respective
vals
valsi
deepest
shuffled
height-balanced
photo
stand
dominoes
machine
subjected
temperature
daily
folders
indexi
fibonacci
constructs
distributions
captured
region
regions
unrooted
abcc
finding
1101
precedence
bought
bricks
quadruplets
len
actually
2359
persons
bracket
pairings
255
levels
widths
wide
ip
startvalue
plots
lies
considering
partially
tournament
subgrid
elapsed
-------------------------
28
bloom
baskets
basket
spiral
themself
unlimited
slices
absnumsi
crossing
submatrix
colori
uncolored
contest
aab
password
amounti
besides
parentsi
vali
unary
restricted
graphi
pointing
--------------------
bef
listed
known
unsigned
statement
videos
expectednumsi
expectednums
assert
expectednumslength
assertions
k-1
seatsi
subgraph
trips
judged
relations
stays
drives
difficulty
pays
sliding
critical
flight
unsorted
viewed
contrast
arrivali
enhances
17
prerequisite
06
evaluating
warehouse
fifth
bounds
getting
representations
64-bit
respect
amounts
fuel
prerequisitesi
numcourses
partitioning
sub
covers
accept
acceptable
sales
asyncronous
34
crosses
old
str1
str2
n2
individual
magic
occupy
lexicographic
reduces
edgesj
val2
val1
variables
strengths
success
smart
belonging
skipped
strategy
party
timeout
cancel
indexes
--------------------------------------
specify
realized
non-equal
pre-order
numsnumslength-1
invalidate
former
js
latter
preserving
reporting
ticket
ticketsi
axes
viewing
cubes
compact
reconstructed
serializationdeserialization
transmitted
stonevalue
tab
extension
filedirectory
directories
throughout
handling
biginteger
wasted
shifta
bacd
sleftirighti
modifications
02
cellsi
arrangements
visible
diameter
flat
burst
bursting
arrow
shot
orderid
related
73
102
eliminate
f3
f2
rowj
colj
guarded
obeys
a4
requirement
transformed
n-queens
placement
numsr-1
numsl1
farthest
stationsi
angle
startcol
executes
foo
pressed
youre
sensitive
soldiers
ratingi
queryint
majority
efficiently
iv
roman
numeral
ii
iiii
900
xxvii
xx
ix
usually
400
xii
engineer
circumference
drawn
ycenter
xcenter
overlapped
matrixij
sequential
floating-point
favorite
sumrangeint
numarray
numarrayint
6-sided
rollsi
obj
fee
faces
page
maxi
cousins
pref
countint
index2
index1
minimizes
gcdnumsi
single-space
completes
movesi
fibonacci-like
456
gamesplayed
eventdate
logging
deviceid
playerid
guesses
tells
reply
guessed
cheese
mouse
targets
eee
february
companys
picky
book
triangles
cyclic
ideal
certainty
eggs
unbroken
egg
breaks
installed
sections
designated
farmland
identified
everybody
copied
molecule
abbreviated
freq
nums2i1
exchange
rotten
doctors
boomerang
multi-dimensional
lower-case
watering
capacities
plantsi
refill
brings
till
1337
lca
comma
sy
tx
ty
sx
mines
tonight
stopping
systems
professional
robbing
recently
counter
cache
incremented
fifo
programming
isfull
isempty
rear
throw
const
promises
yield
promise
resolved
cancelled
thrown
sometimes
shouldnt
abcdefghijklmnopqrstuvwxyz
leftover
pushed
single-threaded
exclusive
permitted
timej
defines
convenience
definitely
reordered
million
ansj
endword
beginword
extended
xi2
tries
dimensions
category
mass
1001
birth
family
king
dead
older
kingdom
dies
successor
marking
death
someone
hash
removekey
optional
population
compress
ccc
numsn-1
numsk1
rootval
natively
peek
peekpop
supported
findint
a-b
punctuation
seqlength
seqi
buses
opponents
training
keysi
took
correctly
exceeding
master
glass
truck
metal
cooldown
aec
speciali
cherries
layout
meetingsi
space-separated
startdayi
enddayi
fancy
newly
presses
tested
retrieves
powx
pairwise
trim
trimmed
insertint
removeint
align
boy
cipher
fulfilled
odd-numbered
6th
an-2
computing
penalty
sea
totally
patterns
bac
triangular
worry
serve
025
pairing
2x
connect
costij
i-1th
groupsi
intersecting
displays
gridi
stationary
rests
tuesday
sunday
monday
save
puts
pascals
numrows
optionally
bbb
comparing
button
spelling
rings
keyi
growing
startj
factorial
memoized
cached
truncates
bash
recorded
updateint
incorrect
communicate
attending
ever
squared
commands
layer
45
performance
situation
faster
short
layers
erase
fair
gap
mutate
choices
movies
movie
cinema
involving
tails
internally
rational
printer
newnums
newnumsi
primes
knights
movements
university
laser
filtering
housesi
yourself
uniform
wooden
ant
self-edges
got
owner
chalkboard
datetime
downwards
one-lane
fleet
miles
ahead
asteroid
asteroids
gains
departure
departs
rain
boundaries
piecesi
si1
fashion
safely
situated
spreads
fresh
serving
batch
obtaining
res
pointslength
pool
scoresi
tic-tac-toe
pending
gridrowicoli
exceeds
initialize
ancestors
locks
parent0
skill
skills
ignore
non-digit
roomsi
chef
awesome
preserved
signs
sake
spreading
relationships
subordinates
walked
namesi
labelsi
foods
235
spanning
shaped
spans
dropping
hits
maxtime
differing
instructed
categories
fs
ice
cream
maxsize
1010
borders
lot
arr2length
worth
landing
reversing
33
summer
yet
parser
filter
maxdistance
restaurants
tuples
gardens
planting
flowersi
incomplete
holding
2th
copies
rx
contaminated
b1
2h
efficient
searches
dominoesi
0110
0190
30ms
50ms
100ms
400ms
60ms
cartesian
union
e1
e2
seed
ratings
blank
mine
temperatures
mode
solvable
collides
collision
collisions
staying
performs
anti-clockwise
stands
f0
shiftsi
super
weightsi
capture
coinsi
traversing
nums0i
classes
wordlength
matched
boardrc
cups
liquid
cup
quarter
180
likes
gone
ladder
natural
node1
node2
backspace
attain
erasing
permute
searchstring
retrieve
spellchecker
insertstring
applications
percent
bill
visiting
reduced
enemy
attacking
extending
non-null
stopped
pixels
depositint
withdrawint
withdraw
deposit
case-sensitive
capitalization
case-insensitive
numerically
19216811
addresses
avoid
90-degree
iteration
violating
numsik
xxxx
separation
aebdc
aeb
maxdeptha
deptha
depthb
depths
vpss
vps
even-indexed
odd-indexed
installing
uninfected
resources
install
infected
135
targeti
sourcei
monotone
ages
agesi
transpose
rope
originally
skyline
citys
increased
contour
uniformly
weakest
innermost
s0
buttons
bulbs
transactionsi
worddict
segmentation
reused
chess
instantly
processing
disconnect
121241510
-5
2510
wheel
turning
sends
213
entered
empid
rods
gas
tank
slice
rides
taxi
bijection
creating
frogs
restrictionsi
bound
s1i
row1
col1
row2
col2
smash
init
delayed
itemsi
typei
warm
strong
inverse
disappear
fruits
isleaf
terminator
bottomright
quad-tree
topright
bottomleft
topleft
proper
sub-grids
sub-grid
wiki
recurse
army
genetic
parents0
orange
list1
heads
list2
safe
pid
attribute
forth
polygon
convex
compiler
java
x3
supposed
driver
routine
halves
kept
removeduplicatesnums
wonderful
brick
erased
pizza
floating
tell
things
important
dividing
yes
attempt
peak
speeds
efficiency
answerx
groupi
aalength
quote
interfere
effective
attendance
award
late
absent
eligible
cookies
losing
flights
mixed
doubly
concept
citationsi
researchers
citations
papers
published
h-index
researcher
cited
views
popular
transfers
transfer
transferred
incoming
i2
afterwards
tracks
ground
exit
arriving
traversed
collecting
bars
waits
falling
forwards
eval
bonus
18
1d
x0
excluded
aajf
grouping
kjf
11106
a-z
successive
weak
fizzbuzz
fizz
buzz
images
equationsi
-10
equations
replaces
274
4237214
242
210
10000
monitor
59
345
upon
answersi
0124567
4567012
encodedi
non
separately
expiration
slash
quotation
powers
join
plan
pig
relation
matrixrowcol
half-closed
describing
57
0001
refers
gold
liter
arrived
divisibility
numsd
numsc
numsb
numsa
angles
tag
browser
infinity
timesi
reformatted
graphs
closing
trap
raining
activities
computers
durationi
resets
requestsi
reside
cba
2019
buyerid
sellerid
comma-separated
012
duplicated
extract
mid
unused
saleid
load
outcome
treesi
mm
surface
linked-list
firsti
reserved
contents
calculator
gcdx
sessions
finishing
provides
lined
service
sij
non-intersecting
excel
sheet
triples
url
history
dash
rightward
bishop
bishops
rooks
rook
3x
offers
inner
flood
selection
active
entrance
parsed
package
packages
abcdefuvwxyz
vyz
term
bucket
fed
feed
allotted
poor
numsindex
maxsum
3n
indirect
110
ranked
worst
personid
hexadecimal
protected
colsum
ch
fn-1
factory
tripsi
occupies
optimize
ranksi
repair
repaired
sudoku
sub-boxes
projects
logical
printnumber
prints
console
attempts
week
bj
decrements
ipv4
hands
lakes
row-wise
coprime
lying
v1
v2
nums2i2
linked-lists
potion
potions
spells
spellsi
potionsj
vote
voting
senator
round-based
senators
dota2
dire
exercise
senate
victory
radiant
announce
predict
parties
ban
rights
encodedstring
kencodedstring
3a
args
cancelfn
side-length
precisely
deliveryid
customerprefdeliverydate
isequal
equality
o2
ccenter
rcenter
seperate
wrote
hills
valley
hill
valleys
digitsi
treenode
ologarrlength
highest-ranked
pricing
2maximumbit
maximumbit
operationsi
baseball
enjoyyourcoffee
enjoy
coffee
heightij
iswater
iswaterij
kj
queuej
queue0
hj
isomorphic
narrow
transport
ministry
orient
reorienting
2019-08-16
changedate
newprice
cubic
storeroom
cube
reportsto
anyone
queuing
wordsij
equal-length
differencei
wordsij1
differenceij
yz
projections
looking
planes
zx
projection
shadow
3-dimensional
dir
subdirectory
abstracted
dirntsubdir1nttfile1extnttsubsubdir1ntsubdir2nttsubsubdir2ntttfile2ext
explained
file1ext
file2ext
opened
subdir1
subsubdir2
looks
new-line
subsubdir1
subdir2
subdirectories
picture
dirsubdir2subsubdir2file2ext
nameextension
uni-valued
multipliers
multipliers1
multipliers0
multipliersi
designing
resize
dynamic
numst
resizing
sizet
shiftx
shiftsi-1
shiftc
pickint
queries0
queries4
abcba
truefalsefalsetruetrue
abba
abcda
modifies
330120031032041
baab
queries1
palidrome
queries3
010221
lyb
queries2
falsetrue
no-zero
fixed-length
ab121p
cdefghijklmn
arbitrarily
abcdefghijklmnop
librarys
pickupi
pickupdelivery
deliveryi
pickup
services
03
additive
cith
rith
flooded
uniquely-sized
13254
spherical
y-direction
xstart
taped
xend
y-coordinates
stretches
commissionrate
alongside
hiredate
salesperson
commission
comid
salesid
salespersons
divisions
monsters
chargethe
defending
weapon
charged
monster
identity
hx
fnx
gx
fghx
guardsi
obstructed
guard
wallsj
sumrunningcosts
runningcosts
charge
chargetimesi
budget
chargetimes
runningcostsi
maxchargetimes
mycalendartwo
doubled
surprisingly
alien
totals
256
sanctioned
government
pre-existing
comprehensiveness
mainly
mechanism
printfirst
operating
printsecond
seem
printthird
imply
texting
pressedkeys
transmission
2266622
jewels
ratingj
soldier
ratingk
majoritychecker
majoritycheckerint
matrc
answerij
wrap-around
global
inversions
monotonically
findsolution
callable
implementations
fxy
functionid
customfunction
fint
circles
circlesi
lattice
voyage
k-similar
mycalendar
commute
depart
trains
107
favorites
companies
favoritecompaniesi
favoritecompanies
n3
enclose
numerator
went
fortunately
observation
observations
grid2
sub-islands
sub-island
grid1
falsy
booleanvalue
one-to-one
omit
kn
face-up
leaveint
examroom
sits
simulates
examroomint
on2
web
developer
pages
-k
streak
aprefix
bprefix
asuffix
ssuffix
bsuffix
sprefix
prefi
punishment
findsumpairsint
tot
nums2index
findsumpairs
numberslength
numbersindex1
numbersindex2
populate
struct
checkoutint
checkin
stationname
railway
getaveragetimestring
startstation
checkout
chronological
consistent
endstation
undergroundsystem
checkinint
underground
getaveragetime
numsy
numsw
numsz
numsx
traversals
bcosti
acosti
flying
interview
fly
arri-1
irrelevant
magnitude
fi
123456579
579
flength
text1
text2
popatstackint
dinnerplatesint
dinnerplates
pm
watch
451
leds
led
0-59
0-11
turnedon
1002
walks
non-obstacle
4-directional
lazy
says
guessesj
reward2i
reward1i
reward2
mice
reward1
targetsi
replacements
eeecd
testcase
sourcesi
abbc
sources
candles
candle
plate
plates
productcategory
abdc
dacb
spectators
bookmyshow
ticketing
concert
hence
gatherint
hall
scatterint
bookmyshowint
vary
maxrow
allocates
bombs
detonated
bomb
felt
bombsi
detonate
unmodified
decorative
dividers
corridor
divider
4-length
hectares
organized
forested
hectare
four-directionally
m-1
areas
nearly
messagesi
sendersi
sender
chat
senders
rumor
secretly
town
trusts
trusti
trust
screen
notepad
paste
tribonacci
tn2
tn3
tn
tn1
t0
useful
10-letter-long
acgaattccg
nucleotides
studying
dna
arts
tars
similarity
rats
secondlen
firstlen
sublist
sublists
decompressed
bobsizes
alicesizes
bobsizesj
alicesizesi
pk
nonempty
primitive
decomposition
outermost
daysi
grows
applesi
rot
yielding
encounters
foobar
printfoo
printbar
repetitively
alicebob
hisher
capacityb
capacitya
cans
waters
wraps
jug2capacity
jug1capacity
pour
measurable
jug
targetcapacity
measure
jugs
extremely
uniqueid
employeeuni
ors
125
nextlargest
arraywrapper
features
gridxiyi
relevant
minesi
arms
lfucache
lfucacheint
maintained
lfu
invalidated
benefits
dequeue
enqueueint
mycircularqueuek
mycircularqueue
rejects
cancellable
promisecatchconsolelog
t50ms
cancellabletasks
settimeoutcancel
t100ms
resolve2
responsibility
yielded
caught
promiseresolve
settimeoutresolve
zabcdefghijklmnopqrstuvwxyzabcdefghijklmnopqrstuvwxyzabcd
wraparound
chocolates
debt
experienceyears
projectid
functionidstart
popped
0start3
endtimestamp
1end2
toggling
middleindex
numsmiddleindex1
numsmiddleindex-1
numsmiddleindex2
songs
song
international
transformations
----
morse
accountsi
accountsi0
k-bit
blockedi
serversi
tasksj
priorities
bababcba
bba
bbabba
yi1
yi2
rectanglei
tiring
well-performing
non-tiring
bulky
heavy
dth
born
kingname
son
well-defined
successorbob
successorjack
throneinheritance
childname
successorking
oldest
deathstring
successorxs
curorder
gave
inheritance
parentname
getinheritanceorder
birthstring
throneinheritancestring
whos
jack
successoralice
successorx
grandchildren
battleship
separates
battleships
110100010
containskey
addkey
myhashset
hashset
arrlen
up-left
unsubscribe
dom
emit
subscribing
emitted
nodejs
subscriptions
enables
subscribed
callbacks
subscribe
referentially
emitting
eventemitter
listeners
alive
birthi
deathi
rowconditionsi
belowi
colconditions
rowconditions
colconditionsi
abovei
numspivot
a2bc3
c3
compression
aabccc
4566701244
0124445667
sub-nodes
minrootleftval
rootrightval
sub-node
bottom-up
myhashmap
hashmap
myqueue
numbercontainers
changeint
fills
hyphens
ab-
ba-c
-ab
afad
hyphen
5247
567
routes0
routesi
8-directionally
energy
defeat
initialenergy
experiencei
defeating
energyi
opponent
initialexperience
ca
aca
abaca
prepending
diffi
subtracted
particularly
variety
official
inspection
001101
encrypted
encrypter
decrypt
carried
encrypts
encryptstring
decrypted
encryption
decryptstring
decryption
encrypterchar
encrypt
allowedguesses
reasonable
masterguessword
masterguess
six-letter-long
bruteforce
helper
333
457
assortment
garbage
traveli
garbagei
trucks
responsible
garbled
towersi
qi
towers
cx
qualities
cy
relaxation
rented
manages
solitaire
fingers
secrets
firstperson
frame
joins
primaryflag
flag
endlessly
loops
reverses
matchsticksi
matchsticks
matchstick
positives
keypad
keypresses
keypress
tester
keyspressedi
releasetimesi
releasetimes0
released
keyspressed
releasetimes
subsequence2
subsequence1
s4
reverseinvertsi
invertx
reversex
0111001
inverts
011100110110001
getmin
minstack
retrieving
763
-55
ns
-255
raised
kith
trimi
funcarr
winston
func
mysterious
grain
wood
randomizedset
adjacentpairsi
forgotten
adjacentpairs
substituted
substitution
appearance
maxjump
minjump
extracandies
kids
kid
even-numbered
4567014
0144567
p123m
iquerieslength-1
patterni
maxoperations
d1d2
discussleetcodecom
subdomains
implicitly
count-paired
subdomain
rep
cpdomains
9001
com
domains
d1d2d3
beneath
stacking
stacked
pleasing
three-letter
aesthetically
hydrogen
molecules
explicitly
synchronization
enforces
barrier
barriers
releaseoxygen
examine
bind
oxygen
bond
releasehydrogen
jane
sentence2
my
sentence1
ps
mls
ml
soup
346
44
max15
max6
ideas
ideab
naming
ideaa
size1
size2
52372
numsliri
insufficient
nodeleft
traverses
noderight
gridin
gravity
inertia
side-view
boxs
fronts
frontsi
backsi
backs
putting
hercy
negativefeedback
feedback
studentid
positivefeedback
studentidi
reporti
combinationlength
combinationiterator
combinationiteratorstring
cake
verticalcutsj
horizontalcuts
verticalcuts
horizontalcutsi
alter
left-out
ababb
obj1
obj2
gifts
intersections
trail
fallout
door
pressing
purpose
1200
stage
freedom
keyword
quest
dial
spelled
anticlockwise
engraved
neededapples
mynumbers
excellent
fibn
factorialn
fib
polish
operand
peekingiterator
peekingiteratoriteratorint
987-123-4567
7890
xxx
xxx-xxx-xxxx
456-7890
one-liner
xxx-xxxx
variation
zuma
volatile
nature
worse
stockprice
correcting
-y
accommodate
by-sa
idea
80
httpsenwikipediaorgwikiskiplist
304050607090
searchint
artyom
comparatively
red-black
eraseint
fine
wikimedia
commons
ologn
cc
kalinin
treap
skiplist
skiplists
taps
watered
one-dimensional
tap
isconnectedij
provinces
isconnected
province
8-character
gene
mutation
aaccggta
startgene
aaccggtt
mutations
endgene
investigate
genre
boring
description
seq1
seq0
seqk
numsseqj
forwardbackward
secondary
randomindex
brand
deep
xrandom
123001212
integerpartnonrepeatingpart
portion
016666666
1230001
212
integerpart
repeatingpart
conventionally
nonrepeatingpart
integerpartnonrepeatingpartrepeatingpart
016666
016
non-alphanumeric
cardpoints
review
movieid
createdat
rated
movierating
left-justified
approach
justified
pad
greedy
maxwidth
pack
targetgridrowcol
targetgrid
solid
maxnums2
minnums2
streamcheckerstring
querychar
detect
streamchecker
axyz
xyz
12321
108
gridrowcolth
illustrates
advance
costs1
planned
365
costs2
costs0
1-day
30-day
7-day
detectsquares
perpendicular
grades
southwest
mirrors
receptors
ray
receptor
truthy
arrayfilter
2d-plane
mailboxes
mailbox
cabxe
cxbae
ba
cabxbae
approaches
clarification
creative
serializes
arr2i
arr1j
appeal
abbca
ensures
rand10
argument
rand7
plank
ants
less-than-or-equal-to
fractions
minnums2i0
nums1ik
nums1i0
nums2ik
nums1i1
event2
endtime1
endtime2
starttime2
event1
starttime1
getindexidx
multiplies
multallm
addallinc
idx
addall
multall
appendval
inc
bipartite
graphu
graphv
scoreij
exams
bookstore
grumpy
grumpyi
technique
sightseeing
spots
valuesj
spot
expired
confirmed
confirming
requested
signups
confirmation
signup
confirmations
brainpoweri
questionsi
decision
sector
rounds0
circulate
marathon
rounds1
sectors
roundsi
30000
recyclable
fat
lowfats
bumper
fleets
slower
slow
catches
time-points
asteroidsi
planet
passengersj
busesi
utensil
pens
cost2
pencils
pen
pencil
cost1
everywhere
swim
rleiterator
exhausted
88855
3825
nextint
rleiteratorint
rle
380925
281825
exhaust
encodingi
exhausts
flattening
arrayflat
suffixes
stayed
fire
grass
safehouse
spread
batchsize
batches
served
donut
donuts
bakes
resr1c2height-r-1
res0n-12
resrc
2height1
resr1c-2height-r-1
rectilinear
bx2
ax2
ay2
by2
ax1
ay1
by1
bx1
countj
pointsj
desiredtotal
maxchoosableinteger
re-use
exception
lrucache
lru
lrucacheint
evict
pangram
lockingtree
unlocked
upgradeint
upgrade
unlockint
locking
upgraded
lockint
lockingtreeint
prevents
airplane
jobsi
devise
people0
people3
reqskills
people1
sufficient
clamped
myatoistring
ccs
atoi
0032
clamp
99e25
0089
-01
2e10
535e93
3e7
-123456e789
6e-1
1e
e3
95a54e53
314
-90e3
--6
1a
serializations
listnode
initialboxes
containedboxesi
statusi
containedboxes
absc1
pointsrc
hotel
roomidi
preferredj
minsizej
absid
sizei
i-2th
numsdivide
operationday
gainloss
stockname
stocks
hourglass
discard
prepared
satisfactioni
cook
like-time
preparation
dishes
satisfaction
dish
preceded
1e5
pipes
wordstxt
one-line
unix
sunny
mn
informtimei
managerheadid
headid
manageri
news
inform
subordination
urgent
golf
peoples
truncating
floorx
floorpilesi
meal
meals
deliciousnessi
deliciousness
153
redirects
redirect
boards
stuck
passingfees
passingfeesj
fees
submitted
math
grade
eg
352
elementary
rewarded
inludes
jsonstringify
objectkeys
20000
50000
accountid
monthly
ts
answerkeyi
maximizing
confuse
falses
truefalse
answerkey
trues
cyclically
janfebmaraprmayjunjulaugsepoctnovdec
revenue
non-bull
ask
cows
xayb
bulls
hint
topping
toppingcostsi
basecosts
toppingcosts
flavor
flavors
dessert
toppings
basecostsi
pops
incint
customstackint
customstack
sentencesi
flow
atlantic
ocean
oceans
pacific
heightsrc
blocksi
recolor
13024
24130
sidelengthi
landed
freezes
leftright
brushing
lexographically
colums
counti
marksi
typesi
indistinguishable
reversed2
1202
12300
retained
2021
reversed1
permn
neighborhood
12233211
neighborhoods
slant
nestedinteger
veganfriendlyi
restaurantsi
filters
maxprice
veganfriendly
-numsi
thorn
cherry
25000000
twenty-five
km2
3000000
countries
gdp
bigint
continent
caretaker
newflowers
k-booking
mycalendarthree
pillow
xr
rxxlrxrxl
lx
xl
removequeriesi
removequeries
player1
2xi
bowling
hit
player2
pins
treenoderightval
treenodeleftval
treenodeleft
treenoderight
treenodeval
findelementstreenode
recovered
findelements
recovers
is2
sentence4
this1
boat
carries
boats
carry
salaryi
minai
bn
za
closes
incur
annual
expectedi
numbottles
drink
numexchange
bottle
bottles
drinking
dominoeslength
dominoesj
0156
40ms
throttle
overwrite
throttled
80ms
2-1
grammar
understood
abefh
comma-delimited
rexpr
acefg
rabbc
re1
acefh
rabcd
ra
abdfh
abefg
concatenations
ek
acdfh
acdfg
rabc
singleton
rw
rabcdefgh
acadbcbd
re2
abdfg
seeding
destroy
derivedi
originali
original0
revealed
char
revealing
unrevealed
clickc
click
clickr
minesweeper
warmer
modes
occurred
ak
scoring
bk
numarrows
shoots
alicearrows
bobarrows
archery
ax
bw
bug
subfolders
bz
az
bxy
bx
underlying
axy
onetwothree
subfolder
directionsi
collided
involved
motion
revision
2533
joined
revisions
version1
version2
belonged
remembers
higheri
loweri
043
ramp
firstlist
endj
secondlistj
firstlisti
secondlist
commonly
0090
9089
089
0090089
directioni
thieves
duty
gang
securityi
addpatch
patches
freqstack
stack-like
marbles
weightsj
marble
distributing
os
heightsi2
heightsj
heightsj-1
maxheightsi1
minheightsi
presence
dv
dva
options
multiplicand
1e-5
succprobi
maxarr0i
converi
conver
ratios
passi
brilliant
classesi
totali
extrastudents
beforehand
addwordword
worddictionaryaddwordbad
addword
worddictionarysearchb
worddictionarysearchbad
worddictionaryaddworddad
worddictionarysearchad
worddictionary
worddictionarysearchpad
nullnullnullnullfalsetruetruetrue
baddadmadpadbadadb
worddictionaryaddwordaddwordaddwordsearchsearchsearchsearch
worddictionaryaddwordmad
11001
buys
uvwxy
pqrst
board00
fghij
klmno
pouring
glasses
100th
champagne
poured
excess
pictured
revx
rev120
revnumsj
revnumsi
rev123
alone
mirrored
koko
bananas
bananas-per-hour
slowly
loves
ladders
hi1
furthest
primefactors
223
shortestpathint
edgecost
edgecosti
addedgeint
graphint
quadruplet
namely
deletetextint
editor
texteditor
min10
cursor
addtextstring
cursorposition
cursorleftint
simulating
currenttextlength
cursorrightint
ceiling
ceilval
ceilnumsi
2m
maxm
snake
nn
n-2
horizontalvertical
separator
thousands
key-cards
keynamei
keyname
keytimei
keycard
one-hour
doors
keytime
emits
saves
0949
key-card
2251
2351
alert
2352
1100
traversing-order
circularly
maintaining
rightchildi
leftchildi
prefers
preferences
preference
preferencesi
unhappy
permuted
4x
shifted
startswithstring
autocomplete
trie
pronounced
dataset
productj
amountj
supermarket
cashierint
frequented
subtotal
productsi
groceries
purchased
cashier
paying
getbillint
countk
statistics
sample
2i
rangefreqquery
rangefreqqueryint
pairslength
endi-1
timer
timeseriesi
teemo
poisoned
hero
ashe
poison
attacks
timeseries
transitive
friendship
friendshipsi
teach
friendships
languagesi
unvisited
backspacing
editors
end-nodes
widths1
result0
result1
widths0
banknotescount
handed
rejected
banknote
atm
withdrawing
deposits
300
banknotes
600
prioritizes
200
checker
errors
operates
yllw
yollow
yeellow
capitlization
handles
mistakes
leavetimei
type-1
type-2
012201
0011255245
1921681312
lane
lanes
obstacles2
lenarr
abaacc
absx1
absy1
no-adjacent-flowers
flowerbed
2k
paragraph
oriented
heroes
minnumsi0
numsik2
maxnumsi0
addbackint
smallestinfiniteset
popsmallest
darts
dartsi
dart
throwing
threw
dartboard
somewhere
personal
mask
10-13
asterisks
0-3
--xxxx
masked
---xxxx
3-1-5-9
13579
7777
out-of-order
rmove
cmove
shiftz
shiftt
depthc
isinfectedij
affected
isinfected
modeled
quarantine
rapidly
threatens
virus
indiceslength
allowedswaps
allowedswapsi
boxesi
completion
onescolj
zerosrowi
zeroscolj
onesrowi
diffij
sub-tree
consuming
graphical
younger
conflicts
basketball
110xxxxx
1-byte
10xxxxxx
n-bytes
translates
-------------------------------------------------------------
octet
unicode
1110xxxx
utf-8
11110xxx
byte
bytes
0xxxxxxx
utf8
taller
one-bit
ryan
colorful
neededtimei
neededtime
-1s
numzeroes
numzeros
numnegones
numones
bix
0-height
prism
carefully
ballsi
hatsi
hats
wear
1549
49
civilians
strongest
weaker
243
243801
801
803
243803
tilt
1110
floornumsi
functionality
3k
statuses
visitid
transactionid
mall
tape
recipe
recipes
recipesi
supplies
ingredientsi
leap
business
arrivebob
mm-dd
leavebob
rome
5-character
arrivealice
31
leavealice
touch
rec2
rec1
cashbacki
qualityi
wage
expectation
wagei
aaaeeeooo
es
aeoiu
uaeio
aaaaaaeiiiioou
aeiou
bouquets
bouquet
bloomdayi
bloomday
invented
universe
stated
discovered
morty
magnetic
c-137
rick
earth
logouttime
seventh
0130
logout
0045
midnight
2345
logintime
0015
act
processingtimei
enqueuetimei
repetitions
sub-sequence
northwest
grids
cstart
rstart
whenever
southeast
bigger
weather
recorddate
yesterday
wrap
deadends
wheels
codes
slot
agey
agex
telephone
2-9
listing
labeling
1440
spent
exits
outtime
entry
intime
eventday
rod
color-position
r3g2b1
capitalize
capitalized
circuit
gasi
cheeseslices
burger
totalsmall
totaljumbo
jumbo
tomato
burgers
tomatoslices
figures
willing
tipi
tip
requesting
ridesi
px
valuediff
indexdiff
ascii
priority
redundant
assumes
maxheighti
upper2
earned
taxes
upper0
upper1
upperi
percent1
upperi-1
bracketsi
tax
percent2
percent0
bracketslength
percenti
taxed
s2j
matrixxy
row2col2
updatesubrectangleint
subrectanglequeries
newvalue
rowcol
subrectangle
row1col1
getvalueint
distancethreshold
10-6
fninit
fnval
arrayreduce
reducer
s1s
store1
store3
store2
3627
0316227
recieve
debounced
debounce
35ms
135ms
95ms
150ms
lengthwordi
lengthwordj
rulekey
rulevalue
namei
winter
heaters
warmed
heater
nextvisit
nextvisiti
cutsi
array-like
snapshot
snapshotarrayint
setindex
getindex
snap
snapshotarray
snapid
violates
depicts
fruitsi
harvest
understand
fort
fortsi
maxij
minij
fortsk
forts
84351
2314
suggests
suggested
minimums
159
numsii
357
numsinumslength
pills
requiring
pill
workersj
elapse
steals
capability
homes
robbed
steal
refuses
assorted
wallet
numsindexi
pahnaplsiigyir
convertstring
paypalishiring
font
legibility
monotonic
splicing
terminal
leads
evil
1j
2016
investment
policy
tiv2016
2015
tiv2015
latitude
lat
longitude
lon
policyholder
insurance
policyholders
holders
def
adc
dfe
minbasket1ibasket2j
fruit
basket1
basket2
python
exponent
bcdea
losers
typewriter
memory2
crashed
faulty
crashes
memory1
memory1crash
memory2crash
crashtime
consumes
triangulation
n-sided
triangulate
5678
1238
5674
blength
encodes
redistribute
subpath
xcnti
subdivide
xcnti-1
maxmoves
cnti
compile
watchedvideosi
friendsi
watchedvideos
watched
general
pictorial
thereafter
practical
sum123
csum123
curried
caaacab
12c
insensitive
abccdef
licenseplate
completing
cbca
alike
trios
trio
productofnumbersgetproduct4
productofnumbersadd4
getproduct
productofnumbersgetproduct3
3025
3025423482
productofnumbersadd3
302
productofnumbersgetproduct2
30254
nullnullnullnullnullnull20400null32
getproductint
overflowing
productofnumbersadd8
productofnumbersaddaddaddaddaddgetproductgetproductgetproductaddgetproduct
302548
productofnumbersadd0
productofnumbersadd5
productofnumbersadd2
productofnumbers
comprised
necesssarily
escaped
backslash
5489355241
5489355142
5489355412
5489355421
5489355214
care
smallest-valued
great
minh
mhts
arraymap
returnedarrayi
erasures
erasure
stable
hitsi
curs
cur
multiples
respecting
minsize
maxletters
kelvin
3200
celsius
27315
fahrenheit
guessing
skilli
chemistry
alex
constituent
lastly
dest
src1
src2
driverid
canceled
cancelledbyclient
cancelledbydriver
role
cancellation
2013-10-01
clientid
requestat
usersid
unbanned
client
partner
cityid
2013-10-03
circumvent
mountainarraygetk
mountainarrgetindex
mountainarr
mountainarray
submissions
disqualification
mountainarraylength
mountainarrayget
interactive
largest-valued
logn
logm
ij
om
countintervals
engineers
efficiencyi
kthlargestint
kthlargest
rededges
blueedgesj
blueedges
rededgesi
beforeitemsi
aar
accelerate
operationsi1
operationsi0
constructa
constructb
constructai
constructa0
macros
comment
comments
implicit
newline
control
gcds
4616
nums20
nums2n
nums1n
nums21
nums11
nums10
difficultyi
workerj
ops
mxy
opsi
pseudocode
nestediterator
iteratorhasnext
iteratornext
nestediteratorlistnestedinteger
nestedlist
words2
words1
36
yy
abbxxxxzyy
bb
terminates
unnecessary
ransomnote
magazine
upper-left
streets
greed
gi
cookie
sub-folders
folderj
folderi
sub-folder
leetcodeproblems
absarri
preserve
avgs
275
avgsi
k-radius
usage
google
usa
capitals
server-to-server
cheapest
dst
src
flightsi
croak
printing
croakoffrogs
croaks
single-level
curr
currnext
multilevel
powerful
1221121221221121122
successors
stages
basically
abbreviate
1234567654321
12345678987600000
express
presuf
suf
pre
presufec
1234589876e5
1234567
546
1234554321
lockedi
revisit
bval
aval
mentor
mentorsj
survey
compatibility
mentors
studentsi
student-mentor
achieved
harmonious
creator
popularity
viewsi
platform
idsi
creators
creatori
account1
withdrawn
transferint
balancei
automate
banklong
account2
imaginary
multiplications
-100
complex
realimaginaryi
rangemodule
overlaps
tracking
tracked
module
queryrangeint
addrangeint
removerangeint
viewdate
viewerid
articles
authors
articleid
authorid
viewer
article
author
gondolas
boardingcost
runningcost
gondola
centennial
scenario
nodei
parentsx
collects
tright
tleft
prepare
prepares
fallen
expends
forces
upright
purposes
startindex
closer
lo
sqrt
snail
colscount
organised
transforms
iterating
rowscount
snailrowscount
homogenous
most-significant-bit
least-significant-bit
ababbc
ac
baa
abcbabcbcb
nums4
nums4l
nums3k
parkingsystem
cartype
parking
medium
park
parkingsystemint
addcarint
months
relationsj
nextcoursej
prevcoursej
decoding
trainer
trainersj
playersi
matchings
trainers
self-loops
-7
wiggle
baaba0
baaabb0
unreachable
10101
contradiction
dj
d2
remapping
mittal
congratulate
sneakily
326
weekly
danny
d1
remap
remaps
infrastructure
storekeeper
arr1i-arr2j
4253
reindexing
01101
32-bits
numwanted
uselimit
logins
floori
carpets
carpetlen
numcarpets
tweet3
721010000
recordtweetstring
tweetcountsrecordtweettweet3
6060
gettweetcountsperfrequencystring
analyzing
120
tweetcountsgettweetcountsperfrequencyhour
gettweetcountsperfrequency
frequencys
70129
60-second
3600-second
tweet
analysis
tweets
tweet30tweet360tweet310minutetweet3059minutetweet3060tweet3120hourtweet30210
site
tweetcounts
86400-second
recordtweet
0210
1069
tweetcountsgettweetcountsperfrequencyminute
997010000
nullnullnullnull221null4
36107209
103609
1010000
listinteger
059
130189
tweetname
tweetcountsrecordtweetrecordtweetrecordtweetgettweetcountsperfrequencygettweetcountsperfrequencyrecordtweetgettweetcountsperfrequency
num1num2
444
sixth
labelling
requestsj
resultj
participates
schemes
profitable
scheme
minprofit
crimes
participate
commit
crime
rabbit
rabbits
installation
weld
steel
billboard
welded
surrounding
img
smoother
rounding
grayscale
wisely
numsindexk
indexk
expressible
numsindex2
numsindex1
conversions
abab
ccjjc
setkey
un-expired
getkey
inaccessible
setting
overwritten
enddate
purchasedate
averageprice
unitssold
startdate
abssum
insertfront
mycirculardequeint
deletefront
deletelast
getrear
mycirculardeque
insertlast
getfront
quot
entities
html
frasl
entity
apos
gt
lt
amp
ampersand
ys
10010
00001
00010
powersj
therere
gregorian
beams
banki
beam
devices
activated
while1
anti-theft
-123
mex
103
made-up
oatgma
goat
consonant
applema
latin
ma
xn-2
xn-1
answerrowcol
rankp
rankq
leftj
246
mixj
thin
segmentsi
145177
47
rather
1412477
mix
paintingj
rightj
0011
1111
2p
orderwith
tilings
tromino
tiling
numberofboxesi
boxtypes
trucksize
boxtypesi
numberofunitsperboxi
followerid
app
followers
follower
uniquecnt2
uniquecnt1
divisor1
divisor2
specialty
retail
quantitiesi
fueli
refueling
refuel
startfuel
mile
transferring
divi
div
word0i
1021
proved
argumentslength
3456
6345
3951
0158
cycled
post
widthiheighti
widthi
widthjheightj
interchangeable
width-to-height
obstruct
vision
posy
posx
angle2
determining
tablenumberi
ordersicustomernameitablenumberifooditemi
customernamei
fooditemi
header
candidate
chairs
leavingi
chair
targetfriend
scrambled
scramble
travelleddistance
edits
edit
subtext2
subtextk
subtexti
subtext1
1-d
segmented
pseudo-critical
mst
msts
index-0
uniques
selldate
stonesj
irreducible
xvalue
yqueeni
queensi
xking
xqueeni
yking
ad
maxnumsj
mi
neccesarilly
sided
rolling
transactedon
transid
pattern0
pattern1
batteries
recharged
processes
battery
batteriesi
arraygroupbyfn
groupby
shuffle
mat31
mat20
mat42
season
achievable
almost
non-repeating
abca
abacba
bcfd
itembrand
joindate
buyer
favoritebrand
itemid
shopping
logarithmic
nums-1
peaks
dcce
fqueriesi
fw
productkey
classroom
cheating
0120
001112
y0
defense
defensej
attacki
propertiesi
attackj
defensei
decimals
register
username
contestid
registered
representatives
representative
prefix-aligned
flipsi
ababc
candiescount
favoritetypei
candiescounti
favoritedayi
dailycapi
poeplei
ethernet
cables
encounter
934126
sentinel
unitprice
2019-03-31
2019-01-01
saledate
n-1-ith
twin
twins
functionalities
freeint
allocateint
allocator
allocatorint
freed
subject
deptid
subjects
teacherid
teaches
subjectid
maxvalue
